package Day30;

public class KioskMain {

	
	/*	제품을 관리하는 프로그램을 작성
	 * - 구매가격, 판매가격은 변동이 없음
	 * 기능
	 * - 제품 등록( 분류, 제품명, 수량, 구매가격, 판매가격)
	 * - 제품 수정
	 * - 제품 삭제
	 * - 제품 구매
	 * - 제품 판매
	 * - 매출액 확인
	 *  - 년별
	 *  	- 제품별
	 *  	- 전체
	 *  - 월별
	 *		- 제품별
	 *  	- 전체
	 *  - 일별
	 *  	- 제품별
	 *  	- 전체
	 *  - 제품별
	 *  	- 제품별
	 *  	- 전체
	 * 
	 * */
	public static void main(String[] args) {
		//메뉴 출력
		/* 1. 제품 등록
		 * 2. 제품 수정
		 * 3. 제품 삭제
		 * 4. 제품 구매
		 * 5. 제품 판매
		 * 6. 매출액 확인
		 * 메뉴 입력 :
		 * */
		//메뉴 선택
		//메뉴 입력에 맞는 기능 실행
		
		//1.제품 등록
			//분류, 제품명, 수량, 구매가격, 판매가격 입력
			//입력후 객체에 저장
			//리스트에 객체 저장
		
		//2.제품 수정
			// 분류 제품명 입력
			// 입력한 값 index에 저장
			// 리스트 호출하고 index 값과 비교 
			// 일치하지 않으면 리턴
			// 일치하면 분류, 제품명, 수량, 구매가격, 판매가격 수정
		
		//3.제품 삭제
			// 분류 제품명 입력
			// 입력한 값 index에 저장
			// 리스트 호출하고 index 값과 비교 
			// 일치하지 않으면 리턴
			// 일치하면 삭제
		
		//4.제품 구매
			// 분류 제품명 입력
			// 입력한 값 index에 저장
			// 리스트 호출하고 index 값과 비교
			// 일치하지 않으면 리턴
			// 일치하면 수량 입력
			// 입력만큼 수량 수정 구매가격저장
		
		//5.제품 판매
		
		//6.매출액 확인

	}

}
